import 'package:flutter/material.dart';
import 'package:get/get.dart';
import 'package:perfect_elegance/app/core/widgets/global_appbar.dart';
import 'package:perfect_elegance/app/data/extensions/extensions.dart';

class TermsView extends GetView {
  const TermsView({super.key});
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: const GlobalAppbar(title: "الشروط و الأحكام"),
      body: SingleChildScrollView(
        physics: const BouncingScrollPhysics(),
        padding: const EdgeInsets.symmetric(horizontal: 16),
        child: SafeArea(
          child: '''شروط استخدام الخدمة:

أولا تعريفات وأحكام عامة

* “مزود الخدمة” تعني شركة (الأناقة المثالية لاستيراد الملابس والمنسوجات) لتوريد الملابس.
* “المستفيد” تعني متاجر بيع الملابس. أو أي شخص يقدم طلبا للاستفادة
الخدمة: تقوم شركة الأناقة المثالية بتوفير خدمة (PE Business) والتي يتم من خلالها شراء وشحن وتوصيل طلبيات المستفيدين من المواقع العالمية حسب ما يتفق عليه الطرفان.
* “المنتجات والبضائع” تعني الطلبيات من ملابس ومنسوجات واكسسوارات التي يطلب المستفيد من المزود تزويده بها * “العقد” تعني هذا العقد. * في حالة حدوث نزاع فالقضاء الليبي هو المختص بحل النزاع
* نحتفظ بالحق في تعديل هذه الشروط في أي وقت. تسري التغييرات والتوضيحات فور نشرها على الموقع. إذا أجرينا تغييرات جوهرية، فسنخطرك هنا بأنه قد تم تحديثها. يمثّل استمرار استخدامك للخدمات بعد تاريخ السريان موافقتك على الشروط المعدلة. تحل البنود المعدلة محل جميع

من خلال الوصول إلى الخدمات واستخدامها، فإنك تؤكد على ما يلي: لقد قرأت وفهمت هذه الشروط؛ سوف تمتثل للشروط؛ وأنت على الأقل في سن الرشد القانوني في مكان إقامتك وغير ذلك من الشروط القانونية للدخول في العقود. سياسة الخصوصية هذه تنطبق فقط على معلومات وبيانات الزبائن التي يتم جمعها من موقع الشركة والبيانات التي يتم تقديمها فقط لشركة الاناقة المثالية مباشرة عن طريق الموقع peg.ly

ثانيا التزامات مزود الخدمة: 

1/ تتعهد شركة (الأناقة المثالية PE Group) بتزويد العملاء بالمنتجات التي تطلبها بكميات وأسعار وشروط التسليم التي يتفق عليها الطرفان

2/ تتعهد شركة (الأناقة المثالية PE Group) بتزويد العملاء بالمنتجات المتفق عليها وفق الجودة المطلوبة وفي فترة زمنية لا تقل عن 20 يوم ولا تزيد عن 30 يوم 

3/ تتعهد شركة (الأناقة المثالية PE Group) في حالة التأخير عن تسليم المنتجات لأكثر من 30 يوم بان تقوم بتخفيض في سعر المنتجات قدرة (10‎%‎) لصالح المستفيد 

4/ تتعهد شركة (شركة الأناقة المثالية PE Group) في حال وصول البضاعة تالفه أو بها عيوب جسيمة بعدم إلزام المستفيد بدفع قيمتها، ويتحمل المستفيد تكلفة الشحن فقط.

ثالثا/ التزامات المستفيد:

يتحمل المستفيد أي خطأ ناتج عن أي عملية ادخال خاطئ لبيانات الطلبية بمنصة (PE Business)

يتعهد العميل بدفع المبلغ المتفق عليه بمجرد إعلامه بوصول البضاعة لمخازن شركة (الأناقة المثالية PE Group) في طرابلس

يتعهد العميل باستلام بضاعته في فترة أقصاها 3 أيام منذ يوم إعلامه بوصول البضاعة، وفي حالة تأخره عن الاستلام يتحمل غرامة مالية تقدرها شركة (الأناقة المثالية PE Group)

يتعهد العميل بفحص البضاعة عند استلامها والتأكد من مطابقتها للشروط المتفق عليها.

يتعهد العميل بإبلاغ شركة (الأناقة المثالية PE Group) عن أي عيوب في البضاعة خلال 24 ساعة الأولي لاستلامه للبضاعة

5/ يتعهد العميل بعدم طلب بضاعة تخالف النظام العام والآداب في ليبيا

إن جميع العلامات التجارية والاسماء التجارية والشعارات المعروضة على هذا الموقع مملوكة لشركة (شركة الأناقة المثالية PE Group) والشركات التي تتعامل معها ولا يسمح لك باستخدامها بأي شكل من الأشكال

باستخدامك منصة (PE Business) المملوكة لشركة (الأناقة المثالية PE Group) فإنك توافق علي هذه الشروط والاحكام، وعند اخلالك بأي شرط من الشروط والاحكام السابقة فإنك تتحمل المسؤولية القانونية الكاملة، وللشركة (الأناقة المثالية PE Group) الحق في اتخاذ ما تراه مناسب من اجراءات قانونية لضمان حقوقها.F'''
              .bodyMedium(),
        ),
      ),
    );
  }
}
